### Part-2
#### 1. String IO
#### 2.Pandas read_csv

In [1]:
import pandas as pd
from io import StringIO
import numpy as np

In [3]:
df = pd.read_csv('test.csv')
df.head()

   Period Age_of_woman  Abortion_rate
0    2000        11-14            0.7
1    2000        15-19           23.1
2    2000        20-24           35.7
3    2000        25-29           24.5
4    2000        30-34           16.4

In [4]:
type(df)

pandas.core.frame.DataFrame

In [6]:
data = ('col1,col2,col3 \n' 'x,y,1 \n' 'a,b,2 \n' 'c,d,3 \n')

In [7]:
type(data)

str

In [ ]:
## in memeory file formate object
StringIO(data)

In [10]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y      1
1    a    b      2
2    c    d      3

In [11]:
pd.read_csv(StringIO(data) , usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [15]:
df.to_csv('new.csv', index=False)

### If you not mentioned any value by default taking NAN value there

In [ ]:
# datatypes in csv


data = ('a,b,c,d \n' '1,2,3,4 \n' '5,6,7,8 \n' '9,10,11')
pd.read_csv(StringIO(data))

   a   b   c   d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [19]:
pd.read_csv(StringIO(data) , dtype='object')

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  NaN

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [21]:
df.isnull().sum()

a     0
b     0
c     0
d     1
dtype: int64

### Working with JSON format's

In [ ]:
data = {"employee_name": "John", "employee_age": 30, "employee_city": "New York" 
        , "employee_salary": 50000}

In [26]:
pd.read_json(StringIO(data))

TypeError: initial_value must be str or None, not dict